In [2]:
# importing necessary packages
import sys
import pandas as pd

In [3]:
# loading data in
csv = 'toy_dataset.csv'
df = pd.read_csv(csv, low_memory=False)
df.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [4]:
# df columns
list(df.columns.values)

['Number', 'City', 'Gender', 'Age', 'Income', 'Illness']

In [5]:
df.duplicated().sum()

0

In [6]:
df.drop_duplicates(inplace=True)
df

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [7]:
df.duplicated().sum()

0

In [8]:
df.to_csv("C:\\Users\\Isaac.CORP\\Downloads\\deduplicatoroutput.csv")